ch14/ch14-2.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-08-17 Thu 10:36 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Chapter 14.2</title>
<meta name="author" content="pedh" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="/css/org-info.css" />



</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="/CLRS-Solutions"> UP </a>
 |
 <a accesskey="H" href="/CLRS-Solutions"> HOME </a>
</div><div id="content" class="content">
<h1 class="title">Chapter 14.2</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org8d235d1">14.2</a>
<ul>
<li><a href="#orgbb845f0">14.2-1</a></li>
<li><a href="#orgffc8de3">14.2-2</a></li>
<li><a href="#orgbcbb43a">14.2-3</a></li>
<li><a href="#org31e3b53">14.2-4</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org8d235d1" class="outline-2">
<h2 id="org8d235d1">14.2</h2>
<div class="outline-text-2" id="text-org8d235d1">
</div>
<div id="outline-container-orgbb845f0" class="outline-3">
<h3 id="orgbb845f0">14.2-1</h3>
<div class="outline-text-3" id="text-orgbb845f0">
<p>
As below, we add 4 pointers to the nodes, and support the dynamic-set queries
in \(O(1)\) worst-case time.
</p>
<pre class="example">
x.left-spine-top: The top of the left spine where x resides
x.right-spine-top: The top of the right spine where x resides
x.left-spine-bottom: The bottom of the left spine where x resides
x.right-spine-bottom: The bottom of the right spine where x resides

MINIMUM(x)
    return x.left-spine-bottom

MAXIMUM()
    return x.right-spine-bottom

SUCCESSOR()
    if x.right != NIL
        return x.right.left-spine-bottom
    return x.right-spine-top.p

PREDECESSOR()
    if x.left != NIL
        return x.left.right-spine-bottom
    return x.left-spine-top.p
</pre>
<p>
Since the pointers we added depend on only the information in nodes x, x.left
and x.right, and those pointers in x.left and x.right, according to <b>Theorem
14.1</b>, the asymptotic performance of other operations on order-statistic
trees are not affected.
</p>
</div>
</div>
<div id="outline-container-orgffc8de3" class="outline-3">
<h3 id="orgffc8de3">14.2-2</h3>
<div class="outline-text-3" id="text-orgffc8de3">
<p>
We can maintain the black-heights of nodes in a red-black tree as attributes
in the nodes of the tree, without affecting the asymptotic performance of the
red-black tree operations, since \(x.bh = x.left.bh + 1\).
</p>

<p>
We cannot maintain The depths of nodes, since the depth of x does not depend
on only the information in nodes x, x.left, and x.right, and the depths of
x.left and x.right.
</p>
</div>
</div>
<div id="outline-container-orgbcbb43a" class="outline-3">
<h3 id="orgbcbb43a">14.2-3</h3>
<div class="outline-text-3" id="text-orgbcbb43a">
<p>
We can update the \(f\) attributes in \(O(1)\) time after a rotation, by
calculating \(x.f = x.left.f \otimes x.a \otimes x.right.f\).
</p>

<p>
Let the value of attributes \(a\) of all nodes be \(1\), and the associative
binary operator \(\otimes\) be \(+\), then we have the \(size\) attributes in
order-statistic tree.
</p>
</div>
</div>
<div id="outline-container-org31e3b53" class="outline-3">
<h3 id="org31e3b53">14.2-4</h3>
<div class="outline-text-3" id="text-org31e3b53">
<pre class="example">
RB-LARGER-MINIMUM(x, a, c)
    if x == NIL
        return c
    if k &lt; x.key
        return RB-LARGER-MINIMUM(x.left, a)
    else
        if x.key &lt; c.key
            c = x
        return RB-LARGER-MINIMUM(x.right, a, c)

RB-ENUMERATE(x, a, b)
    c = RB-LARGER-MINIMUM(x, a, x)
    let keys be an empty array
    while c.key &lt;= b
        keys.append(c)
        // use the O(1) implementation in 14.2-1
        c = RB-SUCCESSOR(c)
    return keys
</pre>
<p>
First we use <code>RB-LARGER-MINIMUM</code> to find the minimum node which has the
larger key than \(a\), this costs \(\Theta(\lg n)\) time, then we perform
iterations of <code>RB-SUCCESSOR</code> to find the next \(m\) nodes until we met the
larger key than \(b\), this costs \(Theta(m)\) time if we are using the
\(O(1)\) time implementation of <code>RB-SUCCESSOR</code> in <b>14.2-1</b>. We implement
<code>RB-ENUMERATE</code> in \(\Theta(m + \lg n)\) time.
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: pedh</p>
<p class="date">Created: 2023-08-17 Thu 10:36</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>